tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Emacs dependency management
brew "cask"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Mac App Store command-line interface
brew "mas"
# Development kit for the Java programming language
brew "openjdk"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Version control system designed to be a better CVS
brew "subversion"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# File and photo tweaking tool
cask "a-better-finder-attributes"
# Renamer for files, music and photos
cask "a-better-finder-rename"
# Text editor
cask "atom"
# Tool to hide status bar icons
cask "dozer"
# Status monitoring
cask "eul"
# Web browser
cask "firefox"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
mas "AdGuard for Safari", id: 1440147259
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
mas "Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "GeoGebra Classic 6", id: 1182481622
mas "Home Assistant", id: 1099568401
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Messenger", id: 1480068668
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Mini Motorways", id: 1456188526
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Outlanders", id: 1468558187
mas "Pages", id: 409201541
mas "Pastel", id: 413897608
mas "PiPifier", id: 1160374471
mas "Sasquatch", id: 1465346522
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "TweetDeck", id: 485812721
mas "Vectornator", id: 1219074514
mas "WHAT THE GOLF", id: 1474771319
mas "Xcode", id: 497799835
